package com.javarush.test.level08.lesson08.task01;

import java.util.HashSet;
import java.util.Set;

/* 20 слов на букву «Л»
Создать множество строк (Set<String>), занести в него 20 слов на букву «Л».
*/

public class Solution
{
    public static HashSet<String> createSet()
    {
      HashSet<String> set = new HashSet<String>();
       set.add("Лурка");//напишите тут ваш код
       set.add("Лурка1");//напишите тут ваш код
       set.add("Лурка2");//напишите тут ваш код
       set.add("Лурка3");//напишите тут ваш код
       set.add("Лурка4");//напишите тут ваш код
       set.add("Лурка5");//напишите тут ваш код
       set.add("Лурка6");//напишите тут ваш код
       set.add("Лурка7");//напишите тут ваш код
       set.add("Лурка8");//напишите тут ваш код
       set.add("Лурка9");//напишите тут ваш код
       set.add("Лурка10");//напишите тут ваш код
       set.add("Лурка11");//напишите тут ваш код
       set.add("Лурка12");//напишите тут ваш код
       set.add("Лурка13");//напишите тут ваш код
       set.add("Лурка14");//напишите тут ваш код
       set.add("Лурка15");//напишите тут ваш код
       set.add("Лурка16");//напишите тут ваш код
       set.add("Лурка17");//напишите тут ваш код
       set.add("Лурка18");//напишите тут ваш код
       set.add("Лурка19");//напишите тут ваш код
            return set;
    }
}
